app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Laundry"], ["description", "Wash and dry clothes"], ["completion_date", ""], ["created_at", "2018-09-20 18:31:06.963638"], ["updated_at", "2018-09-20 18:31:06.963638"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @task = Task.find_by(id: params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @task = Task.find_by(id: params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", ""], ["updated_at", "2018-09-21 20:36:03.658481"], ["id", 11]]
---
    task = Task.find_by(id: params[:id].to_i)
    task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", ""], ["updated_at", "2018-09-21 20:35:31.518864"], ["id", 7]]
---
  def complete
    @task = Task.find_by(id: params[:id].to_i)

    if @task.completion_date == nil
      @task.completion_date = DateTime.now
    else
      @task.completion_date = nil
    end

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 12]]
---
    task = Task.find_by(id: params[:id].to_i)
    task.destroy